{"url_to_unified_index": {"https://www.rollingstone.com/music/music-features/taylor-hawkins-foo-fighters-tribute-1347073/": 1, "https://www.smh.com.au/culture/music/foo-fighters-drummer-taylor-hawkins-my-music-career-started-with-women-20210715-p589z6.html": 2, "https://www.amazon.com/BIOGRAPHY-TAYLOR-HAWKINS-Personal-Award-Winning/dp/B09WRPXPKK": 7, "https://www.forbes.com/sites/stevebaltin/2022/03/26/saturday-conversation-remembering-my-friend-taylor-hawkins-the-biggest-music-fan-i-ever-met/": 8, "https://www.gratitudelodge.com/taylor-hawkins/": 9, "https://fherehab.com/learning/taylor-hawkins-foo-fighters": 10, "https://www.drumeo.com/beat/taylor-hawkins-best-drum-parts-notation/": 5, "https://www.drumeo.com/beat/5-things-taylor-hawkins-taught-us/": 6, "https://en.wikipedia.org/wiki/Taylor_Hawkins": 4, "https://en.wikipedia.org/wiki/Foo_Fighters": 3, "https://www.loudersound.com/features/taylor-hawkins-remembered": 11, "https://ultimateclassicrock.com/taylor-hawkins-influences/": 12, "https://www.ocregister.com/2022/03/26/taylor-hawkins-was-a-rock-star-but-he-got-there-by-being-a-music-fan/": 13}, "url_to_info": {"https://www.rollingstone.com/music/music-features/taylor-hawkins-foo-fighters-tribute-1347073/": {"url": "https://www.rollingstone.com/music/music-features/taylor-hawkins-foo-fighters-tribute-1347073/", "description": "On 2005’s In Your Honor, Hawkins ... actual songwriting process remained minimal. “Foo Fighters is very much Dave’s band,” Hawkins said last year. “A lot of times, when we make a Foo Fighters record, Dave has demos that are pretty close to what he wants to hear. We just go in and fill in the blanks.” · That doesn’t mean Hawkins didn’t add a unique element to the Foos’ songs separate from what Grohl could have simply added on his own. “Taylor sometimes ...", "snippets": ["The last text I have from him is a piece of music that’s just drums. He just sent me this fucking unbelievable drum beat and was like, ‘Make something out of this with one of your artists. This would be awesome. It’s funky and groovy and, like, check this out.'” · Foo Fighters had been staying at the Four Seasons when, at 7:40 p.m., paramedics arrived at the hotel responding to a request to aid a guest suffering from chest pain; that guest was later identified as Hawkins.", "On 2005’s In Your Honor, Hawkins even got to sing lead vocals on a song, “Cold Day in the Sun.” Hawkins would contribute greatly to Foo Fighters for the next 20 years, even if his role in the actual songwriting process remained minimal. “Foo Fighters is very much Dave’s band,” Hawkins said last year. “A lot of times, when we make a Foo Fighters record, Dave has demos that are pretty close to what he wants to hear. We just go in and fill in the blanks.” · That doesn’t mean Hawkins didn’t add a unique element to the Foos’ songs separate from what Grohl could have simply added on his own. “Taylor sometimes played parts that were a little looser, maybe wilder,” producer Butch Vig says.", "A couple of weeks before the Australian trip, Hawkins turned 50. He celebrated with a small party at his house with about a dozen people. “We were all around the table and we all got up and told him how much we loved him and how much he meant to us,” Smith says, fighting back tears. “We all gave a little Taylor anecdote. I’m really glad we had that opportunity because he didn’t want to hear it.", "Oliver Taylor Hawkins was born Feb. 17, 1972, the youngest of three siblings, in Fort Worth, Texas. His father, Terry, had the “stony coldness, typical of a Seventies man,” Hawkins once said, while mother Elizabeth “was full of love, sweetness, and tenderness, and the total opposite of my dad.” Elizabeth nurtured his musical side and would encourage his drumming.", "“We all gave a little Taylor anecdote. I’m really glad we had that opportunity because he didn’t want to hear it. He was making little comments and little smart-ass stuff like he did. But I’m glad that his closest friends got to tell him how much he meant to us and what a beautiful person he was.", "Behind the scenes, according to Sass Jordan, Hawkins dealt with the monotony of touring in less healthy ways. “There was a crew member my manager put on our tour that wasn’t a good influence on Taylor,” she says. “He took that guy with him on the Alanis Morissette tour, and they got into some real trouble with him because there were some substance-abuse issues.” · Morissette played several of the same festivals as Foo Fighters throughout 1995 and 1996, leading to many backstage encounters between Hawkins and Grohl, who spent long nights together smoking cigarettes and geeking out about their favorite bands.", "I remember when he started writing the first Coattail Riders album, he wasn’t that great on guitar, but he could get his ideas together enough to show somebody who could play guitar really well and they could help him finish it. Every time he would play me Coattail Riders stuff, I could see in his eyes just how happy he was. He loved writing his own music.” · “Do not call Taylor Hawkins a ‘drummer,'” Watt says.", "Before Foo Fighters, he cut his teeth backing blues rocker Sass Jordan and Alanis Morissette, and during his time with the band, he explored his full capabilities in side projects including Taylor Hawkins and the Coattail Riders, the Birds of Satan, and the covers group Chevy Metal. His goal, it appeared, was to be the consummate rock star. But while he recorded and performed with several of the artists he idolized (Queen, Led Zeppelin, Jane’s Addiction), he likely never fully understood the impact he had on others around the world. Everyone from Paul McCartney to First Lady Jill Biden shared words of condolence for Foo Fighters and the drummer’s family — widow Alison and the couple’s three children, Oliver, Annabelle, and Everleigh."], "title": "Inside Taylor Hawkins’ Final Days as a Foo Fighter"}, "https://www.smh.com.au/culture/music/foo-fighters-drummer-taylor-hawkins-my-music-career-started-with-women-20210715-p589z6.html": {"url": "https://www.smh.com.au/culture/music/foo-fighters-drummer-taylor-hawkins-my-music-career-started-with-women-20210715-p589z6.html", "description": "My music career started with women; I first came to Australia playing in Alanis Morissette’s band – I owe so much to her. I recorded with many women on my most recent album with the Coattail Riders, Get the Money: Chrissie Hynde, LeAnn Rimes and Heart’s Nancy Wilson.", "snippets": ["Taylor Hawkins discusses his upbringing, career and the women who have influenced him. Occupation: Musician Age: 49 Relationship status: Married Best known for: Being the drummer with Foo Fighters · Taylor Hawkins: “Mum was always there for me emotionally.", "My music career started with women; I first came to Australia playing in Alanis Morissette’s band – I owe so much to her. I recorded with many women on my most recent album with the Coattail Riders, Get the Money: Chrissie Hynde, LeAnn Rimes and Heart’s Nancy Wilson. I did ask Olivia Newton-John but her management never got back to me. Maybe one day. ... I married Alison Hawkins in 2005.", "Taylor Hawkins: “Mum was always there for me emotionally. She let me open up to her and showed me it was okay to have a gentle side.” · My paternal grandmother, Josie Hawkins, grew up in the Great Depression and lived in Jackson, Mississippi. She’d throw us grandkids into the back of her old Buick while wearing giant sunglasses and listening to Kenny Rogers. She was a sweet woman who cooked amazing soul food. She didn’t know how to sit still.", "“I remember going to my first rock concert in 1982 to see Queen. I told Mum, ‘I’ll play that stadium one day,’” says the musician."], "title": "Foo Fighters drummer Taylor Hawkins: ‘My music career started with women’"}, "https://www.amazon.com/BIOGRAPHY-TAYLOR-HAWKINS-Personal-Award-Winning/dp/B09WRPXPKK": {"url": "https://www.amazon.com/BIOGRAPHY-TAYLOR-HAWKINS-Personal-Award-Winning/dp/B09WRPXPKK", "description": "Taylor Hawkins an American musician was born in Fort Worth, Texas, but relocated to Laguna Beach, California, during his early childhood. Hawkins previously acquired reputation as the drummer for Alanis Morissette's Jagged Little Pill visit. He broadly toured with Morissette and Sass Jordan before joining Foo Fighters in 1997. In 2005, Hawkins wedded his long-term sweetheart Alison, who has not just had a huge impact in his own life ...", "snippets": ["Amazon.com: BIOGRAPHY OF TAYLOR HAWKINS: The Personal Life, Career, and Death of an Award-Winning Foo Fighters Drummer: 9798442295672: JORDAN, ANNABEL: Books", "In 2005, Hawkins wedded his long-term sweetheart Alison, who has not just had a huge impact in his own life but has also contributed to his rise as a rock star. The singer revealed in an interview that he never imagined getting married and having a child when he was 25. The couple share a son, Oliver Shane, and two daughters, Annabelle and Everleigh. The drummer released a collection in 2019 that was motivated by his life as a suburban dad and husband.", "The couple share a son, Oliver Shane, and two daughters, Annabelle and Everleigh. The drummer released a collection in 2019 that was motivated by his life as a suburban dad and husband. It was titled Get the Money. The collection had a song titled Middle Child, which Hawkins composed for Annabelle."], "title": "Amazon.com: BIOGRAPHY OF TAYLOR HAWKINS: The Personal Life, Career, and Death of an Award-Winning Foo Fighters Drummer: 9798442295672: JORDAN, ANNABEL: Books"}, "https://www.forbes.com/sites/stevebaltin/2022/03/26/saturday-conversation-remembering-my-friend-taylor-hawkins-the-biggest-music-fan-i-ever-met/": {"url": "https://www.forbes.com/sites/stevebaltin/2022/03/26/saturday-conversation-remembering-my-friend-taylor-hawkins-the-biggest-music-fan-i-ever-met/", "description": "The world lost a great musician last night in Foo Fighters drummer Taylor Hawkins. I was friends with Hawkins for many years. I spoke to him many times over the years. This is how I knew him — a family man first who loved music as much as anyone I knew.", "snippets": ["Come on you get four grown-up men, five grown-up men together, live in each other’s back pocket and act like they’re 14 for the rest of their life there’s gonna be tension. It’s just not natural necessarily. But going back to what you said most music is born out of some sort of joy or friction and there’s both in most bands, as there is in Foo Fighters, not necessarily in Chevy Metal, but that’s just a fucking cover band. Baltin: How does being in a band with Dave influence you? Hawkins: It’s heady if you think about it, and you can’t let things like this go to your head.", "That’s the best way to keep your head in this business and the best way to keep in this business, to not think you’re anything other than a lucky person. You might have a little bit of talent playing music and were in the right place at the right time, and that’s all there is to it. ... HawkinsL There are a lot of these cover bands now, it’s funny, like these professional guy cover bands, like Camp Freddy and all that kind of shit. I was like, “F**k it, it’s something I can do that’s fun, keeps me playing and I can still make some dough cause life doesn’t end.” I want to be able to, when I hit 55, say, “I’m only going to play drums when I want to now.” I have three children now so I have three colleges to think about and all this other kind of s**t, I have a big house.\""], "title": "Saturday Conversation: Remembering My Friend Taylor Hawkins, The Biggest Music Fan I Ever Met"}, "https://www.gratitudelodge.com/taylor-hawkins/": {"url": "https://www.gratitudelodge.com/taylor-hawkins/", "description": "In 2022 the music world experienced a profound loss with the passing of Taylor Hawkins, the renowned drummer from the rock band Foo Fighters.", "snippets": ["Over time, the substance alters the brain’s chemistry, making it challenging to quit without professional help. Effective evidence-based treatments for addiction typically requires a comprehensive approach, including talk therapy, medications, counseling, holistic therapies, and support systems. Long-term management often involves a combination of continuous medical care, lifestyle changes, and support from recovery groups. Colombian authorities have reported that Taylor Hawkins had 10 different drugs in his system at the time of his tragic passing.", "During this critical time, Hawkins was hospitalized, and his situation prompted the Foo Fighters, including frontman David Grohl, to openly address issues of mental health and addiction. Grohl, deeply affected, stayed by Taylor’s side throughout his hospitalization.", "The untimely demise of this beloved drummer deeply affected his fans, many of whom had made long journeys to Colombia from all over the world for the concert. This tragic event has sparked important discussions about drug abuse and mental health at a time when rates of addiction are at an all-time high in the United States. The sudden loss of Taylor Hawkins in 2022 brought to light his previous struggles with substance abuse and addiction."], "title": "Understanding Taylor Hawkins' Battle With Addiction"}, "https://fherehab.com/learning/taylor-hawkins-foo-fighters": {"url": "https://fherehab.com/learning/taylor-hawkins-foo-fighters", "description": "Taylor Hawkins’ drug use and addiction ultimately led to his tragic death. Find out how he reached the point of overdose and what he said about his struggles.", "snippets": ["Find out how the musician’s struggle with drug addiction and his overdose are impacting the conversation around drug abuse and mental health. Taylor Hawkins died while on tour in South America on March 25, 2022. The news of his death broke on a Friday as the Foo Fighters were scheduled to perform a concert in Bogota, Colombia.", "Taylor Hawkins’ sudden death shook his fans, many of whom had traveled to Colombia from other parts of South America for the concert on this leg of the Foo Fighters Tour. Find out how the musician’s struggle with drug addiction and his overdose are impacting the conversation around drug abuse and mental health. Taylor Hawkins died while on tour in South America on March 25, 2022.", "With Taylor Hawkins hospitalized, the rest of the Foo Fighters band spoke up about mental health and addiction. David Grohl, the singer and guitarist for the Foo Fighters, remained at Hawkins’ side throughout his hospital stay. Taylor Hawkins’ 2001 overdose prompted Grohl to tell the Guardian, “When Taylor wound up in hospital, I was ready to quit music."], "title": "Taylor Hawkins Cause Of Death - About His Fatal OD | FHE Health"}, "https://www.drumeo.com/beat/taylor-hawkins-best-drum-parts-notation/": {"url": "https://www.drumeo.com/beat/taylor-hawkins-best-drum-parts-notation/", "description": "Taylor Hawkins, late drummer of the Foo Fighters, was a huge inspiration in the rock world. Here's why.", "snippets": ["But once he found his footing, Taylor become more than just ‘Dave Grohl‘s drummer’ – he became an icon and one of the top rock drummers of all time. His power and energy were unmistakable. You can’t get bored watching him play. He developed his signature style from influences like Roger Taylor, Neil Peart, Phil Collins, Alex Van Halen and Stewart Copeland. These influences came through in his fills and beats and even made their way onto his kit in the form of rototoms and concert toms. He may no longer be with us, but Hawkins’ enthusiasm and love for music will live on forever.", "It’d take hours to go through every single one of his best drum fills. So here are the most iconic: As a huge Neil Peart fan, it’s no surprise that this entire track is full of ‘Neilisms’, including some structural nods to Rush’s “YYZ”. This tasty fill consists of six stroke rolls with snare and tom accents. Sometimes his most epic fills featured his concert toms, like this one from “Crossed The Line”. While he was the drummer of one of the biggest rock bands in the world, Taylor Hawkins was a huge fan of music, period."], "title": "Taylor Hawkins' Best Drum Parts (With Notation) - Drumeo Beat"}, "https://www.drumeo.com/beat/5-things-taylor-hawkins-taught-us/": {"url": "https://www.drumeo.com/beat/5-things-taylor-hawkins-taught-us/", "description": "Losing Taylor Hawkins was a blow to the entire rock community. Here are some reasons why he'll be greatly missed.", "snippets": ["I guess that’s what I’ve been strug­gling for most of my life – to make the drums as important as everything else.”  · There’s no question he did. Bob Dylan wrote: ”The highest purpose of art is to inspire. What else can you do? What else can you do for anyone but inspire them?” There could be no better description of Taylor Hawkins.  · Countless drummers have written that Taylor inspired them to pick up the sticks, fall in love with the drums, set up their kit like him, learn all his parts, play drums and sing — and to have fun in their playing.", "What else can you do for anyone but inspire them?” There could be no better description of Taylor Hawkins.  · Countless drummers have written that Taylor inspired them to pick up the sticks, fall in love with the drums, set up their kit like him, learn all his parts, play drums and sing — and to have fun in their playing.  ... He directly supported many drummers through mentorship, gear, advice, and most importantly, encouragement.", "He once said during a chat with Chad Smith, “I like the way rock ‘n’ roll makes me feel. I like the way music makes me feel.” Taylor expressed himself fully on the drums, and it’s his spirit and love of the music we sense as listeners. One fan wrote, “He embodied how drumming makes us feel.” · Taylor told The Sunday Times in 2010: ”A lot of my favorite drummers…had just as much profile as a guitar player."], "title": "5 Things Taylor Hawkins Taught Us - Drumeo Beat"}, "https://en.wikipedia.org/wiki/Taylor_Hawkins": {"url": "https://en.wikipedia.org/wiki/Taylor_Hawkins", "description": "He also contributed to the band's songwriting, and was listed as a co-writer on at least one song on every Foo Fighters album from There Is Nothing Left to Lose to Medicine at Midnight. Hawkins' final performance with the Foo Fighters before his death was at the Lollapalooza Argentina festival ...", "snippets": ["Noting that official autopsy results had not, at that time, been made public, the Green–Grow article went on to state that \"his friends believe[d] he wasn't using hard drugs recreationally at the time of his death\" and that the post-mortem forensics performed indicated that the mass of Hawkins' heart was \"about double... normal size\", raising the possibility that \"it could have collapsed\" apart from any contribution of drugs in his system.\" The Foo Fighters announced the death of Hawkins in a Twitter statement on March 25, writing that \"His musical spirit and infectious laughter will live on with all of us forever.\"", "Hawkins's first two major inspirations were Roger Taylor and Stewart Copeland. He reported that listening to these two drummers' different styles showed him a wide spectrum of drumming style. He also mentioned that he would play along with songs on the radio or records, like Queen's News of the World, to enhance his skills when he was young. During his career, Hawkins used a variety of different brands, including Ludwig Drums, Tama Drums, and, most notably, Gretsch Drums, which he endorsed and played from 2005 until his death.", "The band's self-titled debut album was released in April 2014, with a release party at 'Rock n Roll Pizza' featuring the Foo Fighters guesting on some of the cover tracks. In an interview with Radio X, Hawkins revealed that his initial idea with his solo projects was to duet with female singers. Hawkins invited other stars to sing in the Taylor Hawkins and the Coattail Riders album Get the Money, such as LeAnn Rimes, who sang on one of his songs titled \"C U In Hell\". Loudwire named the album one of the 50 best rock efforts of 2019. Other musicians who appeared on his projects included Roger Taylor, Brian May, Dave Grohl, Nancy Wilson, Joe Walsh, Chrissie Hynde, and many more.", "Anyone who wants to be good on the drums should check him out – the man is a master. Hawkins's first two major inspirations were Roger Taylor and Stewart Copeland. He reported that listening to these two drummers' different styles showed him a wide spectrum of drumming style. He also mentioned that he would play along with songs on the radio or records, like Queen's News of the World, to enhance his skills when he was young. During his career, Hawkins used a variety of different brands, including Ludwig Drums, Tama Drums, and, most notably, Gretsch Drums, which he endorsed and played from 2005 until his death.", "Hawkins invited other stars to sing in the Taylor Hawkins and the Coattail Riders album Get the Money, such as LeAnn Rimes, who sang on one of his songs titled \"C U In Hell\". Loudwire named the album one of the 50 best rock efforts of 2019. Other musicians who appeared on his projects included Roger Taylor, Brian May, Dave Grohl, Nancy Wilson, Joe Walsh, Chrissie Hynde, and many more.", "During his career, Hawkins used a variety of different brands, including Ludwig Drums, Tama Drums, and, most notably, Gretsch Drums, which he endorsed and played from 2005 until his death. He was also known to use Zildjian Cymbals.", "Hawkins recorded the drum tracks for the Coheed and Cambria album Good Apollo, I'm Burning Star IV, Volume Two: No World for Tomorrow as the band's regular drummer, Chris Pennie, could not record because of contractual reasons. Hawkins also toured with Coheed and Cambria shortly during the months of the album. Hawkins can also be heard drumming on Eric Avery's (formerly of Jane's Addiction) first solo effort, Help Wanted and on Kerry Ellis's album, Wicked in Rock.", "The Foo Fighters were joined by Travis Barker, Nandi Bushell, Martin Chambers, Chris Chaney, Dave Chappelle, Stewart Copeland, Josh Freese, Liam Gallagher, Omar Hakim, Justin Hawkins, Joshua Homme, Chrissie Hynde, The James Gang, Alain Johannes, Brian Johnson, John Paul Jones, Greg Kurstin, Geddy Lee, Alex Lifeson, Brian May, Paul McCartney, Chris Rock, Nile Rodgers, Mark Ronson, Sam Ryder, Luke Spiller, Supergrass, Roger Taylor, Rufus Taylor, Lars Ulrich, and Wolfgang Van Halen, plus members of Hawkins's cover band, Chevy Metal. His son Oliver Shane Hawkins paid tribute to his father with the band during a performance of \"My Hero\" by taking on his father's role as drummer.", "The second tribute concert, at the Kia Forum in Inglewood, California, took place on September 27, 2022, and featured Hawkins' bandmates as well as numerous guest artists. Returning from the London show were Barker, Copeland, Hakim, Homme, Johannes, Jones, Kurstin, Lee, Lifeson, May, Novoselic, Ronson, Smith, Spiller, Roger Taylor, Rufus Taylor, Ulrich, Van Halen, the James Gang, and Chevy Metal.", "The Foo Fighters were joined by Travis Barker, Nandi Bushell, Martin Chambers, Chris Chaney, Dave Chappelle, Stewart Copeland, Josh Freese, Liam Gallagher, Omar Hakim, Justin Hawkins, Joshua Homme, Chrissie Hynde, The James Gang, Alain Johannes, Brian Johnson, John Paul Jones, Greg Kurstin, Geddy Lee, Alex Lifeson, Brian May, Paul McCartney, Chris Rock, Nile Rodgers, Mark Ronson, Sam Ryder, Luke Spiller, Supergrass, Roger Taylor, Rufus Taylor, Lars Ulrich, and Wolfgang Van Halen, plus members of Hawkins's cover band, Chevy Metal.", "Hawkins said that his drumming was chiefly influenced by classic rock drummers, including Phil Collins of Genesis; Stewart Copeland of the Police, whom he idolized and eventually befriended; Budgie of Siouxsie and the Banshees; Roger Taylor of Queen; Stephen Perkins of Jane's Addiction; Jim Gordon of Derek and the Dominos; Neil Peart of Rush; Alex Van Halen of Van Halen; and John Bonham from Led Zeppelin. Hawkins was once guest editor of Rhythm and interviewed Collins, Copeland, Taylor, and Perkins for the issue.", "Collins is an incredible drummer. Anyone who wants to be good on the drums should check him out – the man is a master. Hawkins's first two major inspirations were Roger Taylor and Stewart Copeland. He reported that listening to these two drummers' different styles showed him a wide spectrum of drumming style."], "title": "Taylor Hawkins - Wikipedia"}, "https://en.wikipedia.org/wiki/Foo_Fighters": {"url": "https://en.wikipedia.org/wiki/Foo_Fighters", "description": "Foo Fighters is an American rock band formed in Seattle in 1994. Founded as a one-man project by former Nirvana drummer Dave Grohl, the lineup now consists of Grohl (lead vocals, guitar), Nate Mendel (bass), Chris Shiflett and Pat Smear (guitars), Rami Jaffee (keyboards), and Josh Freese (drums). Drummers William Goldsmith and Taylor Hawkins...", "snippets": ["Foo Fighters is an American rock band formed in Seattle in 1994. Founded as a one-man project by former Nirvana drummer Dave Grohl, the lineup now consists of Grohl (lead vocals, guitar), Nate Mendel (bass), Chris Shiflett and Pat Smear (guitars), Rami Jaffee (keyboards), and Josh Freese (drums). Drummers William Goldsmith and Taylor Hawkins, along with guitarist Franz Stahl, are former members of the band. Grohl created Foo Fighters after the breakup of Nirvana in 1994 to release solo material.", "Around 2001, Foo Fighters established a relationship with the English rock band Queen, as the band (particularly Grohl and Hawkins) were fans. That March, Grohl and Hawkins inducted them into the Rock and Roll Hall of Fame and joined them to perform the 1976 classic, \"Tie Your Mother Down\", with Hawkins playing drums alongside Roger Taylor. The guitarist Brian May added a guitar track to Foo Fighters' second cover of Pink Floyd's \"Have a Cigar\", which appeared on the soundtrack to the movie Mission: Impossible 2. In 2002, May contributed guitar to \"Tired of You\" and the outtake \"Knucklehead\"."], "title": "Foo Fighters - Wikipedia"}, "https://www.loudersound.com/features/taylor-hawkins-remembered": {"url": "https://www.loudersound.com/features/taylor-hawkins-remembered", "description": "Jon Davison was 10 years old when a family from Fort Worth, Texas moved into his neighbourhood in Laguna Beach, Orange County in 1981. The new arrivals had a kid a year younger than him, with a stack", "snippets": ["Two years on from the death of Taylor Hawkins, we remember and celebrate the life of the Foo Fighters drummer, natural showman and perennial 'Mister Fanboy'"], "title": "Taylor Hawkins: A celebration of the life of the late Foo Fighters drummer | Louder"}, "https://ultimateclassicrock.com/taylor-hawkins-influences/": {"url": "https://ultimateclassicrock.com/taylor-hawkins-influences/", "description": "A roundup of quotes from Taylor Hawkins discussing his various classic rock influences.", "snippets": ["Even as he became a superstar member of a famous rock band, late Foo Fighters drummer Taylor Hawkins remained a passionate fan of the groups that came before him. Never modest when discussing his influences, the drummer regularly heaped praise on Rush, Genesis and the Police - bands that just happened to employ some of the greatest drummers in rock history: Neil Peart, Phil Collins and Stewart Copeland, respectively.", "It's amazing - and with rock 'n' roll it's all about energy, isn't it? When you hear the energy off the drums and music like that, you just want to put it on loud and drive down the street with it blasting. It's like, 'Hey, dudes, this rocks!\" Rhythm magazine (1998)", "Below are some of the biggest classic rock artists who influenced Hawkins and what they meant to him, in his own words. ... \"Roger Taylor playing 'We Are the Champions' with Queen - I will never forget watching that. I remember all this sweat flying off his hair - he was so visual, the ultimate in cool and collected."], "title": "Taylor Hawkins' Classic Rock Influences: In His Own Words"}, "https://www.ocregister.com/2022/03/26/taylor-hawkins-was-a-rock-star-but-he-got-there-by-being-a-music-fan/": {"url": "https://www.ocregister.com/2022/03/26/taylor-hawkins-was-a-rock-star-but-he-got-there-by-being-a-music-fan/", "description": "The 50-year-old drummer was a member of the Rock and Roll Hall of Fame with the Foo Fighters, but the Orange County native loved rock music and talking about his favorite bands.", "snippets": ["Taylor Hawkins was that musical joy personified not only as a performer, but also as a fan. Taylor Hawkins, John Densmore and Stephen Perkins perform during A Celebration for Ray Manzarek at the Fonda Theatre in February 2016. (File photo by Kelly A. Swift) Taylor Hawkins, shown here in 2016, was best known musically for his work behind the kit as the Foo Fighters’ drummer.", "ObituaryObituary Reports the death of an individual, providing an account of the person’s life including their achievements, any controversies in which they were involved, and reminiscences by people who knew them. ... Taylor Hawkins, shown here in 2016, was best known musically for his work behind the kit as the Foo Fighters’ drummer."], "title": "Taylor Hawkins was a rock star, but he got there by being a music fan – Orange County Register"}}}